
Функция APIget(Запрос)
	
	ЗаписьЖурналаРегистрации("APIget");
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат СформироватьСтраничку(Ответ);    	

КонецФункции

Функция APIpost(Запрос)
	
	ТелоЗапроса  = Запрос.ПолучитьТелоКакСтроку();
	ЗаписьЖурналаРегистрации("APIpost" );   
	ЗаписьЖурналаРегистрации("ТелоЗапроса",,,,ТелоЗапроса);   
	МЗ = РегистрыСведений.РегистрСведений1.СоздатьМенеджерЗаписи();
	МЗ.Период = ТекущаяДата();
	МЗ.Тело =  ТелоЗапроса;
	МЗ.Записать();
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат СформироватьСтраничку(Ответ);    
	
КонецФункции    

Функция СформироватьСтраничку(Ответ)
	
	Ответ.Заголовки.Вставить("Content-Type","text/html");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "Authorization,Content-type, Accept");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "POST");// и какие там еще есть методы у данного шаблона запроса
	Макет = ПолучитьОбщийМакет("МояСтраничка");	
	Ответ.УстановитьТелоИзСтроки(Макет.ПолучитьТекст());   
    Возврат Ответ;
	
КонецФункции


